const data = {
    a: 'hello',
    b: 'owu',
    c: 'com',
    d: 'ua',
    num1: 1,
    num2: 10,
    num3: -999,
    num4: 123,
    num5: 3.14,
    num6: 2.7,
    num7: 16,
};
for (const key in data) {
    console.log(data[key as keyof typeof data]);
}

console.log(5 === 5);
console.log(5 !== 5);

// Взяти дз №4-6 з модуля по js та типізувати їх. Зверніть особливу увагу на те, що функції тепер щось повертають і це треба типізувати!
// Завдання можна копіювати з виконаних дз по js та впроваджувати типізацію безпосередньо в них, замінивши розширення файлів.

// Взяти дз №4-6 з модуля по js та типізувати їх. Зверніть особливу увагу на те, що функції тепер щось повертають і це треба типізувати!
// Завдання можна копіювати з виконаних дз по js та впроваджувати типізацію безпосередньо в них, замінивши розширення файлів.